Jeremie11-11/stm32cube_Dcc_Decoder/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "string.h"
#include "stdio.h"
#include "stdlib.h"
#include "define.h"
#include "version.h"
#include <m_counter.h>
#include <debug.h>
#include "i_gpio.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define GPIO_Output___LED_STAT_GREEN_Pin GPIO_PIN_12
#define GPIO_Output___LED_STAT_GREEN_GPIO_Port GPIOB
#define GPIO_Output___LED_STAT_RED_Pin GPIO_PIN_15
#define GPIO_Output___LED_STAT_RED_GPIO_Port GPIOB
#define GPIO_Output___TIM1_CH1_Pin GPIO_PIN_8
#define GPIO_Output___TIM1_CH1_GPIO_Port GPIOA
#define GPIO_Output___TIM1_CH2_Pin GPIO_PIN_9
#define GPIO_Output___TIM1_CH2_GPIO_Port GPIOA
#define GPIO_Input___DCC_RX_Pin GPIO_PIN_6
#define GPIO_Input___DCC_RX_GPIO_Port GPIOB
#define GPIO_Output___DCC_UPLINK_Pin GPIO_PIN_9
#define GPIO_Output___DCC_UPLINK_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
